{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"ffdc365f-c0a0-481f-a5d4-a019add1c6fa":{"type":"collapsible-content","blocks":{"collapsible_row_gQKk7V":{"type":"collapsible_row","settings":{"heading":"How do I set up my BDG table?","icon":"none","row_content":"<p>Our Beer Die tables require a one time assembly. This allows us to package the table securely and to ensure you receive a table in great condition. The assembly should take no longer than 15 minutes and we really appreciate your help here as we previously struggled with damages during shipment. Please click <a href=\"\/pages\/beer-die-table-best-practices\" title=\"BDG Table Assembly\/Best Practices\">here<\/a> to see table assembly instructions and best practices for enjoying your new table!<\/p>","page":""}},"collapsible_row_ynaGRr":{"type":"collapsible_row","settings":{"heading":"How do I charge my GID Dice?","icon":"none","row_content":"<p>In order to get your GID dice glowing, you must charge them! To charge them, use a phone flashlight, a lamp, or any other light source you have. We suggest charging the dice for 45-60 seconds for optimal glow. While you are playing, charge the dice not in use and then rotate them in and out every 2-3 minutes!<\/p>","page":""}},"collapsible_row_iXEt3G":{"type":"collapsible_row","settings":{"heading":"What dot does the custom dice image replace?","icon":"none","row_content":"<p>The image on our custom dice replaces the 1 dot! When we first launched we had a mold made that allowed us to do this, so unfortunately we don't have the ability to replace any other numbers. That being said, we are hoping to add a new mold that allows us to replace the 6 dot this fall (upon popular request), so stay tuned!<\/p>","page":""}},"collapsible_row_BgGiAW":{"type":"collapsible_row","settings":{"heading":"How should I seal\/paint my Paint Your Own Table?","icon":"none","row_content":"<p><strong>Sealing - <\/strong> Polyurethane is a good coating as it is thin, does not significantly impact bounces, and does not yellow as much as other lacquers or varnishes in the sun!<\/p><p><strong>Painting - <\/strong> Premium exterior house paint works great as it resists sun and moisture damage, and you can purchase samples from your local hardware store that are large enough to cover the whole table surface. Most any paint will work though for your more intricate designs (latex, acrylic, water\/oil based) however, we suggest adding another clear coating after you finish to protect your design.<\/p>","page":""}},"collapsible_row_iKhc6G":{"type":"collapsible_row","settings":{"heading":"How is the bounce on your tables?","icon":"none","row_content":"<p>We are very proud of the bounces on our table. We tested countless types of plywoods and found the one that we felt had the most fun, unpredictable bounces. Additionally, the vinyl on top has no negative impact on the bounce and we think it might actually improve the bounces!<\/p>","page":""}},"template--16719812264153__ffdc365f-c0a0-481f-a5d4-a019add1c6fa-collapsible_row-1":{"type":"collapsible_row","settings":{"heading":"What is Beer Die?","icon":"none","row_content":"<p>Beer Die is a popular drinking game involving 4 people, a table, dice, cups and beer. Each player stands at a corner of the table, next to their partner, and across from their opponent. Teams stand at opposite sides of a table, throw a die underhand above a certain height, and try to get the die to land on the opponent’s side of the table. The objective is to score points by hitting the opponent’s side of the table and having the die hit the ground, or by getting the die directly into the opponent’s cups. The team on defense tries to catch the die with one hand before it hits the ground, without reaching over the table at any point. Games are usually played to 9 and drinking rules vary, but for more details about the rules and scoring check out our beer die rules page <a href=\"\/pages\/beer-die-faq\" title=\"Beer Die FAQs\">here<\/a>.<\/p>","page":""}},"template--16719812264153__ffdc365f-c0a0-481f-a5d4-a019add1c6fa-collapsible_row-2":{"type":"collapsible_row","settings":{"heading":"What is the history of Beer Die?","icon":"none","row_content":"<p>While it seems the true history is unclear, likely due to the nature of being a drinking game, the consensus is that Beer Die was started in the early 1970s. After some rather minimal research, we determined it most likely started at the University of Maine in 1972. There were additional claims that it was started by a variety of different groups around the same time period including - Naval officers, students at UC Santa Clara, and students at Colby College. As lovers of Beer Die, we will gladly update this section should someone know more about the history of the beautiful game. Regardless of who the true founder was, what we do know is that we are eternally grateful for all the groups that helped introduce Beer Die to help it become what it is today, the best drinking game out there.<\/p>","page":""}},"template--16719812264153__ffdc365f-c0a0-481f-a5d4-a019add1c6fa-collapsible_row-3":{"type":"collapsible_row","settings":{"heading":"What makes someone good at Beer Die?","icon":"none","row_content":"<p>While many games focus solely on quick ways to get drunk, Beer Die has much more to it. It is a game that takes skill, hand-eye coordination, and longevity. The game is broken down into 3 aspects, and the best players are good at all three. There is offense, defense, and of course, drinking.<\/p><p><strong>Offense<\/strong>: It requires a lot of skill to score points. You need to be able to throw the dice over the height requirement, be accurate to make the defense work, and have the threat of hitting or sinking the cup. The motion of throwing a dice underhand is unique and not natural for many people, so the more you play and get your reps in, the better you will be. The best players get reps in and are naturals who were born to sink cups. You must score to win, so these players are a special asset for your Beer Die team.<\/p><p><strong>Defense<\/strong>: It requires athleticism, good reactions, and good hand-eye coordination. Dice can take unpredictable bounces and are hard to catch for the average person, so it can be hard to prevent points. Because of this, if you can master the craft of catching dice you can make it very hard for your opponent to score. The best players are like the best wide receivers, they don’t drop easy ones and they make spectacular catches that change a game. If you have great hands, you will always be a desirable partner.<\/p><p><strong>Drinking: <\/strong>Most importantly there is drinking and the ability to handle yourself. At the end of the day it is a drinking game, and the goal is to win and to drink. If the goal were to play a skill game and win, people would play spikeball. If the goal were to drink and win, people would play flip cup. But that’s not the goal and that’s why we play Beer Die. Drinking during a game isn’t challenging, the challenge is continuing to drink as you stay on the table. The best players can stay sharp on offense, and more challengingly on defense, as they continue to delete beers throughout a win streak.<\/p>","page":""}},"template--16719812264153__ffdc365f-c0a0-481f-a5d4-a019add1c6fa-collapsible_row-4":{"type":"collapsible_row","settings":{"heading":"Snappa vs Beer Die?","icon":"none","row_content":"<p>Snappa is another form of Beer Die that is quite popular, but it is played seated. The rules have a few key differences but are relatively similar. The main distinctions (besides being seated) are that the dice has to go between, or over, the two cups to be live (unless it hits the cup), and that the dice doesn’t have to land over halfway to be live. Additionally Snappa is usually played on a table that is 8ft x 2ft which helps to encourage more contact with the cups.<\/p><p>Snappa is a great game as it can be played indoors much more easily, and it is perfect for the lazy people who don’t want to move but still want to compete. There is something nice about not leaving your chair, standing up, and being in a different state. There are fewer better bonding experiences for four friends than playing Snappa together for a few hours. Going to college in Boston, there weren’t many great Beer Die venues, so we fell in love with Snappa. Snappa is the Winter Olympics to the Beer Die Summer Olympics. While it may lack some key benefits, Snappa still serves a vital role and allows you to throw dice.<\/p>","page":""}},"8f718e63-298b-455f-957d-739946d08876":{"type":"collapsible_row","settings":{"heading":"Why do Beer Die rules vary?","icon":"none","row_content":"<p>One of our favorite aspects of Beer Die is how different it is from group to group. We went to a school where it was played by 3-4 fraternities at the time and each fraternity had its own set of rules. If one school can’t even agree on a set of rules, picture how different rules are as you travel across the country. What makes Beer Die beautiful is figuring out the rules that work for your group. Maybe your group is too good at offense and sinking is too easy, so you play everything is worth one point. Maybe your group is a bunch of offensive lineman and FIFA is nearly impossible, so you play traditional FIFA rules. And maybe you just learned how to play so you play by the rules on our site. None of that matters. What matters is that you are playing Beer Die and enjoying the beautiful game.<\/p>","page":""}}},"block_order":["collapsible_row_gQKk7V","collapsible_row_ynaGRr","collapsible_row_iXEt3G","collapsible_row_BgGiAW","collapsible_row_iKhc6G","template--16719812264153__ffdc365f-c0a0-481f-a5d4-a019add1c6fa-collapsible_row-1","template--16719812264153__ffdc365f-c0a0-481f-a5d4-a019add1c6fa-collapsible_row-2","template--16719812264153__ffdc365f-c0a0-481f-a5d4-a019add1c6fa-collapsible_row-3","template--16719812264153__ffdc365f-c0a0-481f-a5d4-a019add1c6fa-collapsible_row-4","8f718e63-298b-455f-957d-739946d08876"],"settings":{"caption":"","heading":"Beer Die FAQs","heading_size":"h1","heading_alignment":"center","layout":"row","color_scheme":"background-1","container_color_scheme":"background-2","open_first_collapsible_row":true,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":28,"padding_bottom":60}}},"order":["main","ffdc365f-c0a0-481f-a5d4-a019add1c6fa"]}